## Handling Missing Value using - Interpolate() Function
    Pnadas interpolate() function is basically used to fill NaN values in DataFrame and Series.
    Very Powerfull Function
    Uses various interpolation techniques

In [3]:
import pandas as pd

In [7]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\student_result1.csv")
df.head(2)

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80

### Using interpolate function

In [10]:
df.interpolate()

C:\Users\Dell\AppData\Local\Temp\ipykernel_23048\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

### Using interpolate -  method = "Linear"

In [14]:
df.interpolate(method= 'linear')

C:\Users\Dell\AppData\Local\Temp\ipykernel_23048\1450789841.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method= 'linear')

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

### Using interpolate - method = ' time '

In [17]:
# [NOTE : one of the col. should be in time - date dtype ]

In [21]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\student_result1.csv",index_col='Student ID')
df.head(3)

           Section  Class  Study hrs  Social Media usage hrs  Percentage
Student ID
1001             A     10          2                       3          50
1002             B     10          6                       2          80
1003             A     10          3                       2          60

### Using interplate - method = ' index '

In [24]:
df.interpolate(method = 'index')

C:\Users\Dell\AppData\Local\Temp\ipykernel_23048\4266139948.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method = 'index')

           Section  Class  Study hrs  Social Media usage hrs  Percentage
Student ID
1001             A     10          2                       3          50
1002             B     10          6                       2          80
1003             A     10          3                       2          60
1004             C     11          0                       1          45
1005             C     12          5                       2          75

### Using axis parameter

In [26]:
df.interpolate(axis=0)

C:\Users\Dell\AppData\Local\Temp\ipykernel_23048\2122669812.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(axis=0)

           Section  Class  Study hrs  Social Media usage hrs  Percentage
Student ID
1001             A     10          2                       3          50
1002             B     10          6                       2          80
1003             A     10          3                       2          60
1004             C     11          0                       1          45
1005             C     12          5                       2          75